app/controllers/notes_controller.rb

  def index
    @notes = Note.search(params[:search]).paginate(:per_page => 6, :page => params[:page])
---
SELECT "notes".* FROM "notes" WHERE (lower(title) LIKE '%test1%' OR description LIKE '%test1%') LIMIT 6 OFFSET 0

  def create
    @note = Note.new(note_params)

	respond_to do |format|
      if @note.save
---
INSERT INTO "notes" ("checked", "confirm", "created_at", "description", "photo", "priority", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @note.update(note_params)
---
UPDATE "notes" SET "priority" = ?, "description" = ?, "photo" = ?, "checked" = ?, "confirm" = ?, "updated_at" = ? WHERE "notes"."id" = 2  [["priority", "a"], ["description", "Editing Test"], ["photo", nil], ["checked", "false"], ["confirm", "0"], ["updated_at", Fri, 16 May 2014 12:20:52 UTC +00:00]]

   def check
    @note.checked = 'true'
    @note.save
---
UPDATE "notes" SET "checked" = ?, "updated_at" = ? WHERE "notes"."id" = 2  [["checked", "true"], ["updated_at", Fri, 16 May 2014 12:20:53 UTC +00:00]]

   def uncheck
    @note.checked = 'false'
    @note.save
---
UPDATE "notes" SET "checked" = ?, "updated_at" = ? WHERE "notes"."id" = 2  [["checked", "false"], ["updated_at", Fri, 16 May 2014 12:20:53 UTC +00:00]]

   def delchecked

     ary = Array.new();
   	Note.all.each do |note|
		if note.checked == 'true'
		 	ary.push(note.id)
		end
	end
	ary.each { |x|
		@note = Note.find(x)
		@note.destroy
---
SELECT "notes".* FROM "notes"
SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "notes" WHERE "notes"."id" = ?  [["id", 2]]